const questions = {
    "1": {
    "text": 'Ознакомьтесь с основными направлениями развития современных технологий обслуживания Основными направлениями развития современных технологий обслуживания в ресторанах, барах и кафе являются: создание концептуальных предприятий общественного питания; расширение сети виртуальных ресторанов, обеспечивающих прием заказа по сети Интернет и доставку его потребителю; приготовление блюд в присутствии посетителей; организация обслуживания по системе кейтеринг; внедрение мерчандайзинга (сбыта продукции и услуг).',
    "type": "step",
    "img_path": "image/1.jpg",
    },
    "2": {
    "text": 'Ознакомьтесь более подробно с перечисленными выше основными направлениями развития технологий обслуживанияКонцептуальным называется ресторан, в котором интерьер оформлен в национальном или экзотическом стиле, а в меню возможно смешение кухонь и стилей. Идея концептуального ресторана включает выбор предпринимателем определенной темы, в соответствии с которой разрабатывается меню, оформляется интерьер, выбираются поставщики оборудования, посуды, приборов, продуктов, напитков. В качестве темы может быть использован кинематографический, исторический, литературный или другой сюжет, легенда. Избранная тема предусматривает, например, создание ресторана – кабаре, трактира или клуба. Виртуальным называется ресторан, в котором осуществляется прием заказа по сети Интернет и доставка его потребителю. Основной потребитель страничек в Интернете – предполагаемый потребитель ресторана. Он может не только ознакомиться с информацией, отправить и получить сообщение, но и поговорить с менеджером ресторана и даже видеть его в момент разговора. Потребитель может не только заказать столик в ресторане, но и оплатить его, введя номер счета или кредитной карты.',
    "type": "step",
    "img_path": "image/2.jpg",
    },
    "3": {
    "text": 'Ознакомьтесь более подробно с современными технологиями обслуживания К современным технологиям обслуживания в общественном питании, способствующим привлечению потребителей и увеличению объемов продаж, относится приготовление блюд в присутствии посетителей. Для привлечения внимания гостей к этим блюдам необходимо дать правильное описание и фотографии их в меню, произвести обучение персонала. К приготовлению блюд на глазах у посетителей привлекаются опытные повара. В ресторане «Токио» (Москва), где горячее блюдо готовится на специальных плитах – теппаняки перед гостем, повар должен не только виртуозно владеть ремеслом, но и уметь общаться с гостями. К прогрессивным технологиям обслуживании в ресторанном бизнесе относится организация выездного обслуживания по системе кейтеринг. Термин «кейтеринг» (от англ. catering – общественное питание, cater – поставлять продукцию, обслуживать потребителя) обозначает действия работника или предприятия, поставляющего продукты питания, напитки, посуду и все необходимое для организации приема, банкета вне ресторана или обслуживания спортивных игр и других крупных зрелищных мероприятий. Существуют следующие виды кейтеринга: в помещении, вне ресторана, социальный, разъездной (по контракту на поставку продукции), розничная продажа, VIP – кейтеринг.',
    "type": "step",
    "img_path": "image/3.jpg",
    },
    "4": {
    "text": 'Ознакомьтесь со следующими приемами мерчандайзинга Мерчандайзинг общественного питания – деятельность по стимулированию сбыта продукции и услуг общественного питания. Это направление можно рассматривать как один из методов создания потребительских предпочтений. Для увеличения объема продаж в ресторане, кафе или баре применяется следующие приемы мерчандайзинга: • дизайн блюд и напитков; • внедрение новых методов обслуживания; • агитации в зале; • убеждающая продажа; • предложение в выборе альтернативных продукции и услуг.',
    "type": "step",
    "img_path": "image/4.jpg",
    },
    "5": {
        "text": "Как называется предоставление услуг по приготовлению блюд для проведения общественного мероприятия:",
        "type": "question",
        "options": [
            {
                "text": "социальный кейтеринг;",
                "correct": true
            },
            {
                "text": "общественное питание;",
                "correct": false
            },
            {
                "text": "разъездной кейтеринг.",
                "correct": false
            }
        ]
    },
    "6": {
        "text": "Что НЕ относится к основным направлениям развития современных технологий обслуживания в ресторанах, барах и кафе: ",
        "type": "question",
        "options": [
            {
                "text": "создание концептуальных предприятий общественного питания; ",
                "correct": false
            },
            {
                "text": "приготовление блюд в присутствии посетителей; ",
                "correct": false
            },
            {
                "text": "составление карты вин сомелье;",
                "correct": true
            },
            {
                "text": "организация обслуживания по системе кейтеринг; ",
                "correct": false
            },
            {
                "text": "расширение сети виртуальных ресторанов, обеспечивающих прием заказа по сети Интернет и доставку его потребителю;",
                "correct": false
            },
            {
                "text": "внедрение мерчандайзинга (сбыта продукции и услуг).",
                "correct": false
            }
        ]
    },
    "7": {
    "text": 'Ознакомьтесь с основными элементами обслуживания в ресторане Обслуживание в ресторане складывается из следующих элементов: • встреча гостей, размещение их в зале; • предложение меню и карты вин, аперитива; • рекомендации в выборе закусок, блюд, напитков; • прием, оформление и уточнение заказа; • передача заказа на производство; • досервировка стола в соответствии с принятым заказом; • подача напитков, закусок и блюд; • расчет с гостями.',
    "type": "step",
    "img_path": "image/7.jpg",
    },
    "8": {
    "text": 'Ознакомьтесь с основными этапами встречи и размещения гостей в ресторане Встреча и размещение гостей У входа в ресторан гостей встречает швейцар, который дает краткую характеристику ресторану и бару, ориентируя на особенности ассортимента предлагаемых напитков и блюд. Затем приглашает войти в ресторан или бар, придерживая входные двери. У входа в зал гостей встречает hostess, который приветствует их, предлагает занять столики и места в зале, знакомит с официантом, возвращается на свое рабочее место, а по окончании обслуживания он, как радушный хозяин, провожает гостей, прощается с ними и приглашает вновь посетить ресторан.',
    "type": "step",
    "img_path": "image/8.jpg",
    },
    "9": {
    "text": 'Ознакомьтесь с правилами приёма и оформления заказа в ресторане Прием и оформление заказа Прием заказа следует начать с подачи официантом меню гостю, если ранее это не было сделано метрдотелем или hostess. Подавая меню гостю, следует помнить, что право выбора блюд имеет женщина. Поэтому меню вручается даме, а если их несколько — старшей из них. Если за столом сидят мужчины, то предпочтение отдается старшему по возрасту, юбиляру и т. д., а у военных — старшему по званию. При двусторонней рассадке гостей за столом следует подать второй экземпляр меню, чтобы гости быстрее с ним ознакомились. Меню подают гостю слева. При наличии твердой обложки меню подают раскрытым на первой странице, где перечислены блюда от шеф-повара и фирменные блюда. Одновременно с предложением меню заказчику предлагают ознакомиться с картой вин. Заказ удобно принимать стоя справа от заказчика, но можно и слева, если это удобно для официанта. Важно запомнить заказчика, потому что в дальнейшем все опросы согласовываются только с ним. Официант в процессе приема заказа выслушивает все пожелания заказчика, дет рекомендации, если необходимо. Официант должен хорошо знать меню ресторана. При отсутствии в меню пояснений по составу и особенностям приготовления блюд это должен сделать официант.',
    "type": "step",
    "img_path": "image/9.jpg",
    },
    "10": {
        "text": "С какой стороны должен подойти официант к посетителю?",
        "type": "question",
        "options": [
            {
                "text": "а)	слева",
                "correct": true
            },
            {
                "text": "б)	справа",
                "correct": false
            },
            {
                "text": "в)	по центру",
                "correct": false
            },
            {
                "text": "г)	сзади",
                "correct": false
            },
            {
                "text": "д)	все ответы верны",
                "correct": false
            }
        ]
    },
    "11": {
        "text": "Меню - это…",
        "type": "question",
        "options": [
            {
                "text": "а)	соответствующий документ",
                "correct": false
            },
            {
                "text": "б)	перечень закусок, блюд, напитков, мучных кондитерских изделий , имеющихся в продаже на данный день с указанием цены",
                "correct": true
            },
            {
                "text": "в)	накладная",
                "correct": false
            },
            {
                "text": "г)	сертификат",
                "correct": false
            },
            {
                "text": "д)	товарный чек",
                "correct": false
            }
        ]
    },
    "12": {
    "text": 'Ознакомьтесь с основными направлениями работы сомелье Работа сомелье. Рекомендации по выбору и подача вин  В разработке карты вин и их подаче в ресторане главная роль отводится сомелье. Сомелъе (от франц. sommelier) — это человек, ответственный за подачу напитков в ресторане, дающий советы по выбору вин и напитков и следящий за их подачей гостю вплоть до окончания обслуживания. Сомелье подходит к гостям, предлагает карту вин, дает рекомендации по выбору напитков к заказанным блюдам, сообщает об особенностях рекомендуемых напитков. При этом следует помнить, что правильное и умеренное употребление алкогольных напитков, сочетаемость их между собой и с различными блюдами, закусками, время, частота и последовательность приема напитков в комплексе определяют культуру их потребления. ',
    "type": "step",
    "img_path": "image/12.jpg",
    },
    "13": {
    "text": 'Ознакомьтесь со следующей схемой передачи заказа на производство Передача заказа на производство Обслуживание в ресторане ведется по следующей схеме: из зала официант направляется в сервизную, где подбирает посуду для холодных блюд и закусок, приносит ее на раздачу холодного цеха и передает на производство вместе с заказом, сообщив, сколько порций следует положить в каждую вазу, блюдо, салатник, а также пожелания гостей по приготовлению блюда. При обслуживании группы гостей блюда отпускают и подают на стол в многопорционной посуде: вазах, салатниках и т.д., вместимость которых должна соответствовать количеству порций. Это дает возможность поварам красиво оформить блюда, а официантам — удобно расставить их на столе. Из холодного цеха официант направляется в горячий, где передает заказ на горячие закуски, первые и вторые блюда, некоторые десертные блюда, одновременно передавая поварам посуду для тех блюд, которые готовят непосредственно в этой посуде (кокотницы, кокильницы, порционные сковородки, керамические горшочки для тушеных блюд и др.). После передачи заказа на производство официант производит досервировку стола в зале в соответствии с заказом и убирает со стола ненужные предметы сервировки.',
    "type": "step",
    "img_path": "image/13.jpg",
    },
    "14": {
        "text": "Составляет винную карту ресторана?",
        "type": "question",
        "options": [
            {
                "text": "а)	сомелье ;",
                "correct": true
            },
            {
                "text": "б)	метрдотель;",
                "correct": false
            },
            {
                "text": "в)	зам.директора;",
                "correct": false
            },
            {
                "text": "г)	хостес;",
                "correct": false
            },
            {
                "text": "д)	директор. ",
                "correct": false
            }
        ]
    },
    "15": {
        "text": "Когда заканчивается обслуживание гостей?",
        "type": "question",
        "options": [
            {
                "text": "когда гости оплатили счёт;",
                "correct": false
            },
            {
                "text": "когда дверь заведения за ними закрылась;    ",
                "correct": true
            },
            {
                "text": "с момента подачи гостям счёта.",
                "correct": false
            }
        ]
    },
    "16": {
        "text": "Как не следует поступать, если гость недоволен процедурой подачи пищи, сравнивая ее с сервисом в других ресторанах",
        "type": "question",
        "options": [
            {
                "text": "а)	рассказать особенности технологии приготовления и подачи блюд в ресторане;",
                "correct": false
            },
            {
                "text": "б)	спорить с посетителем, доказывая свою компетентность;",
                "correct": true
            },
            {
                "text": "в)	пригласить в зал ресторана метрдотеля или шеф-повара.",
                "correct": false
            }
        ]
    },
}

var score = 0;
var originalOption
var originalQuestionNumber
var button_list


document.addEventListener('DOMContentLoaded', function() {
    setSlide(1);
    button_list = document.getElementById('button_list');
    updateQuestionNumber(1)
});


function updateQuestionNumber(question_number) {
    console.log('Update' + question_number)

    originalQuestionNumber = document.getElementsByClassName('question_number')[0];
    button_list.innerHTML = ''

    for (let option_index in questions) {
        // console.log(option_index);
        const clonedQuestionNumber = originalQuestionNumber.cloneNode(true);
        button_list.appendChild(clonedQuestionNumber);
        clonedQuestionNumber.style.display = 'inline-block'
        var question_number_li = clonedQuestionNumber.getElementsByClassName('question_number_li')[0]
        question_number_li.innerHTML = option_index
        console.log(option_index + ' ' + question_number, option_index == question_number, option_index < question_number)
        if (option_index == question_number) {
            question_number_li.className = 'question_number_li current'
        }
        else if (option_index < question_number) {
            question_number_li.className = 'question_number_li passed'
        }
        else if (option_index > question_number) {
            question_number_li.className = 'question_number_li'
        }
    }
}


function setSlide(number) {
    number = Number(number);
    console.log('Setting question ' + number);

    originalOption = document.getElementsByClassName('option')[0];

    var question = questions[number];

    if (number == Object.keys(questions).length) {
        // console.log('Yes')
        document.getElementById('next_question').style.display = 'none'
        document.getElementById('finish_test').style.display = 'block'

        var step_tag = document.getElementById("step");
        step_tag.setAttribute('question_number', number);
    }
    // else {
        // console.log('No')

    var slide_tag = document.getElementById("slide");
    slide_tag.setAttribute('slide_number', number);

    if (question['type'] == 'step') {
        console.log('STEP')

        var step_tag = document.getElementById('step').style.display = 'block'
        document.getElementById('question').style.display = 'none'

        document.getElementById('slide_img').src = question['img_path']
        document.getElementById('slide_p').innerHTML = question['text']
    }
    else if (question['type'] == 'question') {
        console.log('QUESTION')

        document.getElementById('step').style.display = 'none'
        document.getElementById('question').style.display = 'block'

        var question_tag = document.getElementById("question");

        p = document.getElementById('question_text');
        p.innerHTML = question['text'];

        var questions_ul = document.getElementById('questions_ul');
        questions_ul.innerHTML = '';

        for (let option_index in question['options']) {
                const option = question['options'][option_index];
                const clonedOption = originalOption.cloneNode(true);
                questions_ul.appendChild(clonedOption);
                var option_id = "option" + option_index;
                label_tag = clonedOption.getElementsByTagName('label')[0];
                label_tag.innerHTML = option['text'];
                label_tag.setAttribute('for', option_id);
                input_tag = clonedOption.getElementsByTagName('input')[0];
                input_tag.setAttribute('correct', option['correct']);
                input_tag.id = option_id;
                input_tag.checked = false;
                clonedOption.style.display = 'block'
            }
    }

    originalOption.style.display = 'none'


}


function nextSlide() {
    var question_tag = document.getElementById('question');
    // console.log(question_tag)
    var options = question_tag.getElementsByTagName('input');
    for (var j = 0; j < options.length; j++) {
        var option = options[j];
        // console.log(option.getAttribute('correct'));
        if (option.checked && option.getAttribute('correct') === 'true') {
            score++;
            break;
        }
    }

    var step_tag = document.getElementById("slide");
    var slide_number = Number(step_tag.getAttribute('slide_number'));

    console.log('Slide number ' + slide_number)

    var next_slide_number = slide_number + 1;
    setSlide(next_slide_number);
    updateQuestionNumber(next_slide_number);
}


function endTest() {
    results_div = document.getElementsByClassName('test_results')[0]
    results_div.style.display = 'block'
    test_results_p = document.getElementById('test_results_p');
    test_results_p.innerHTML = 'Ваш результат: ' + score

    document.getElementById('question').style.display = 'none'
    document.getElementById('finish_test').style.display = 'none'
    document.getElementById('step').style.display = 'none'
}
